#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated Resource

  with module.dbtcloud_github_snowflake.module.snowflake.snowflake_grant_privileges_to_role.warehouse,
  on .terraform/modules/dbtcloud_github_snowflake/modules/snowflake/main.tf line 51, in resource "snowflake_grant_privileges_to_role" "warehouse":
  51: resource "snowflake_grant_privileges_to_role" "warehouse" {

This resource is deprecated and will be removed in a future major version
release. Please use snowflake_grant_privileges_to_account_role instead.

(and 16 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dbt_cloud/dbt_cloud_workspace/runs/run-5UggPkXcTuHfxRst

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.dbtcloud_github_snowflake.module.dbtcloud_common.dbtcloud_project.dbt_project will be created
  + resource "dbtcloud_project" "dbt_project" {
      + id   = (known after apply)
      + name = "Customer_Name"
    }

  # module.dbtcloud_github_snowflake.module.dbtcloud_common.dbtcloud_project_repository.dbt_project_repository will be created
  + resource "dbtcloud_project_repository" "dbt_project_repository" {
      + id            = (known after apply)
      + project_id    = (known after apply)
      + repository_id = (known after apply)
    }

  # module.dbtcloud_github_snowflake.module.dbtcloud_common.dbtcloud_repository.dbt_repository will be created
  + resource "dbtcloud_repository" "dbt_repository" {
      + azure_bypass_webhook_registration_failure = false
      + deploy_key                                = (known after apply)
      + fetch_deploy_key                          = false
      + git_clone_strategy                        = "github_app"
      + github_installation_id                    = 267820
      + id                                        = (known after apply)
      + is_active                                 = true
      + project_id                                = (known after apply)
      + remote_url                                = (known after apply)
      + repository_credentials_id                 = (known after apply)
      + repository_id                             = (known after apply)
    }

  # module.dbtcloud_github_snowflake.module.github.github_branch_protection.dbt_repo will be created
  + resource "github_branch_protection" "dbt_repo" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }
    }

  # module.dbtcloud_github_snowflake.module.github.github_repository.dbt_repo will be created
  + resource "github_repository" "dbt_repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Code for the dbt project Customer_Name"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dbt_customer_name"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false
    }

  # module.dbtcloud_github_snowflake.module.github.null_resource.post_repo_creation will be created
  + resource "null_resource" "post_repo_creation" {
      + id = (known after apply)
    }

  # module.dbtcloud_github_snowflake.module.snowflake.random_password.password["PROD"] will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "TF_VAR_snowflake_username" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-5UggPkXcTuHfxRst/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "TF_VAR_snowflake_password" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-5UggPkXcTuHfxRst/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 34, in provider "snowflake":
│   34:   username = var.snowflake_username
│ 
│ Use `user` instead of `username`
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.dbtcloud_github_snowflake.module.snowflake.snowflake_grant_privileges_to_role.warehouse,
│   on .terraform/modules/dbtcloud_github_snowflake/modules/snowflake/main.tf line 51, in resource "snowflake_grant_privileges_to_role" "warehouse":
│   51: resource "snowflake_grant_privileges_to_role" "warehouse" {
│ 
│ This resource is deprecated and will be removed in a future major version
│ release. Please use snowflake_grant_privileges_to_account_role instead.
│ 
│ (and 16 more similar warnings elsewhere)
╵
╷
│ Error: open snowflake connection: 390100 (08004): Incorrect username or password was specified.
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 32, in provider "snowflake":
│   32: provider "snowflake" {
│ 
╵
Operation failed: failed running terraform plan (exit 1)

```

</details>

*Pusher: @anaisvaillant, Action: `pull_request`, Working Directory: `deployments/customer_name`, Workflow: `terraform plan on PR`*